Model Listing and README.md Updated
